#### GetParameter Method

---

|  |
| --- |
| FamilyManager Class   See Also |

Obtains the family parameter with the given built-in parameter identifier.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public FamilyParameter GetParameter( 	ForgeTypeId parameterTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetParameter ( _ 	parameterTypeId As ForgeTypeId _ ) As FamilyParameter ``` |

| Visual C++ |
| --- |
| ``` public: FamilyParameter^ GetParameter( 	ForgeTypeId^ parameterTypeId ) ``` |

#### Parameters

parameterTypeId
:   Type:  Autodesk.Revit.DB ForgeTypeId
     Identifier of the built-in parameter.

# Remarks

Returns    a null reference (  Nothing  in Visual Basic)  if the parameter is not found.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter). |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was NULL |

# See Also

FamilyManager Class

Autodesk.Revit.DB Namespace